# (Создайте этот файл в корне проекта)
# Используем официальный базовый образ Python 3.11 (можете выбрать свою версию)
FROM python:3.13.9-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости
# --no-cache-dir экономит место
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь код проекта в рабочую директорию
# (src, venv, .env и т.д. - все, что в корне)
COPY . .

# Команда для запуска вашего бота (предполагая, что main.py в корне)
CMD ["python", "main.py"]